# DataFrame

In [1]:
# 패키지 설치
from pandas import DataFrame

## DataFrame 생성

In [4]:
grade_data = [
    [1, "남자", 98, 77, 88, 64],
    [2, "여자", 88, 90, 62, 72],
    [1, "남자", 92, 70, 83, 79],
    [3, "여자", 63, 60, 31, 70],
    [4, "남자", 75, 50, 90, 88],
]

# 2차원 리스트를 DF 형태로 변환
df = DataFrame(grade_data)
df

   0   1   2   3   4   5
0  1  남자  98  77  88  64
1  2  여자  88  90  62  72
2  1  남자  92  70  83  79
3  3  여자  63  60  31  70
4  4  남자  75  50  90  88

인덱스와 컬럼 이름 지정하면서 데이터 프레임 생성

In [6]:
i_names = ['철수', '영희', '민철', '수현', '호영']
c_names = ['학년', '성별', '국어', '영어', '수학', '과학']

# 지정한 index, columns 이름 반영
df = DataFrame(grade_data, index = i_names, columns=c_names)
df

    학년  성별  국어  영어  수학  과학
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

리스트를 원소로 갖는 딕셔너리

In [7]:
grade_dic = {
    "학년" : [1, 2, 1, 3, 4],
    "성별" : ['남자', '여자', '남자', '여자', '남자'],
    "국어" : [98, 88, 92, 63, 75],
    "영어" : [77, 90, 70, 60, 50],
    "수학" : [88, 62, 83, 31, 90],
    "과학" : [64, 72, 79, 70, 88]
    }

df = DataFrame(grade_dic)
df

   학년  성별  국어  영어  수학  과학
0   1  남자  98  77  88  64
1   2  여자  88  90  62  72
2   1  남자  92  70  83  79
3   3  여자  63  60  31  70
4   4  남자  75  50  90  88

인덱스 이름과 제목을 지정하면서 데이터 프레임 생성

In [8]:
df = DataFrame(grade_dic, index=['철수', '영희', '민철', '수현', '호영'])

df.index.name = '이름'
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

딕셔너리를 원소로 갖는 리스트로부터 생성

In [9]:
grade_list = [
    {"학년" : 1, "성별" : "남자", "국어":98, "영어":77, "수학":88, "과학":64},
    {"학년" : 2, "성별" : "여자", "국어":88, "영어":90, "수학":62, "과학":72},
    {"학년" : 1, "성별" : "남자", "국어":92, "영어":70, "수학":83, "과학":79},
    {"학년" : 3, "성별" : "여자", "국어":63, "영어":60, "수학":31, "과학":70},
    {"학년" : 4, "성별" : "남자", "국어":75, "영어":50, "수학":90, "과학":88},
]
df = DataFrame(grade_list)
df

   학년  성별  국어  영어  수학  과학
0   1  남자  98  77  88  64
1   2  여자  88  90  62  72
2   1  남자  92  70  83  79
3   3  여자  63  60  31  70
4   4  남자  75  50  90  88

인덱스 이름과 제목 지정

In [10]:
df = DataFrame(grade_list, index = ['철수', '영희', '민철', '수현', '호영'])
df.index.name = "이름"
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

## csv 파일로부터 가져오기 (쉼표로 구분)

In [11]:
from pandas import read_csv

csv 파일을 데이터 프레임으로 가져오기

In [15]:
df = read_csv("grade.csv", encoding='euc-kr')
df

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88

로딩이 완료된 데이터프레임의 특정 열을 인덱스로 변경(원본 유지)

In [16]:
df2 = df.set_index("이름")
df2

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

inplace를 사용해 인덱스 설정을 원본에 반영

In [17]:
df.set_index("이름", inplace=True)
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

데이터 로딩시 인덱스 열을 지정

In [18]:
df = read_csv("grade.csv", encoding="euc-kr", index_col="이름")
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88

엑셀 파일로부터 가져오기

In [19]:
from pandas import read_excel

In [20]:
df = read_excel("grade.xlsx")
df

   이름  학년  성별  국어  영어  수학  과학
0  철수   1  남자  98  77  88  64
1  영희   2  여자  88  90  62  72
2  민철   1  남자  92  70  83  79
3  수현   3  여자  63  60  31  70
4  호영   4  남자  75  50  90  88

index 이름 지정

In [21]:
df = read_excel("grade.xlsx", index_col="이름")
df

    학년  성별  국어  영어  수학  과학
이름
철수   1  남자  98  77  88  64
영희   2  여자  88  90  62  72
민철   1  남자  92  70  83  79
수현   3  여자  63  60  31  70
호영   4  남자  75  50  90  88